<?php

$students = [
 ["name" => "Абдуллаев Данил", "grades" => [5, 4, 5]],
 ["name" => "Бакиева Неда", "grades" => [4, 5, 5]],
 ["name" => "Быков Глеб", "grades" => [5, 5, 5]],
 ["name" => "Васнецов Кирилл", "grades" => [5, 5, 5]],
 ["name" => "Гараев Адир", "grades" => [5, 5, 5]],
 ["name" => "Иванов Дарий", "grades" => [4, 5, 5]],
 ["name" => "Исполенко Иван", "grades" => [5, 5, 5]],
 ["name" => "Козлов Владислав", "grades" => [5, 5, 5]],
 ["name" => "Крашков Максим", "grades" => [5, 5, 5]],
 ["name" => "Максимова Мария", "grades" => [5, 5, 4]],
 ["name" => "Марков Борис", "grades" => [5, 5, 5]],
 ["name" => "Михайлов Роман", "grades" => [5, 4, 5]],
 ["name" => "Москвинов Данил", "grades" => [4, 5, 5]],
 ["name" => "Окунев Владимир", "grades" => [5, 5, 5]],
 ["name" => "Петров Анна", "grades" => [5, 5, 5]],
 ["name" => "Поповкин Тимофей", "grades" => [5, 5, 4]],
 ["name" => "Проворотов Лев", "grades" => [4, 4, 5]],
 ["name" => "Рейтов Никита", "grades" => [3, 4, 5]],
 ["name" => "Рябцев Дмитрий", "grades" => [4, 5, 5]],
 ["name" => "Савинов Максим", "grades" => [4, 5, 5]],
 ["name" => "Серебрянская Каролина", "grades" => [4, 5, 5]],
 ["name" => "Тюбов Никита", "grades" => [4, 5, 5]],
 ["name" => "Чугуподеева Дарья", "grades" => [4, 4, 5]],
 ["name" => "Шульцова Татьяна", "grades" => [4, 5, 5]],
 ["name" => "Щербаков Матвей", "grades" => [4, 5, 5]]
];

foreach ($students as $student) {
 $name = $student['name'];
 $grades = $student['grades'];
 $average = array_sum($grades) / count($grades);
 echo "Средняя оценка для $name: " . number_format($average, 2) . "\n";
}
